In [47]:
# Import libraries
import pandas as pd
import re
import requests as req
from bs4 import BeautifulSoup as bs
import json
import warnings
warnings.simplefilter('ignore')
from sqlalchemy import create_engine

# MySQL

In [52]:
a= open("../Password.txt","r").read()

In [53]:
str_conn=f"mysql+pymysql://root:{a}@localhost:3306"

motor=create_engine(str_conn)  # motor de conexion

In [64]:
# motor.execute('create database moma;')

In [65]:
str_conn=f"mysql+pymysql://root:{a}@localhost:3306/Moma"

motor=create_engine(str_conn)

In [66]:
data=pd.read_csv('moma.csv')
data.head(3)

  Classification  year                    artist      country
0   Architecture  1987  Christian de Portzamparc       France
1   Architecture  1987              Rem Koolhaas  Netherlands
2   Architecture  1987       Madelon Vriesendorp  Netherlands

In [67]:
data.to_sql(name='Artists', con=motor, if_exists='append', index=False)

In [68]:
pd.read_sql('select * from Artists', motor).head(3)

  Classification  year                    artist      country
0   Architecture  1987  Christian de Portzamparc       France
1   Architecture  1987              Rem Koolhaas  Netherlands
2   Architecture  1987       Madelon Vriesendorp  Netherlands

In [62]:
data=pd.read_csv('education.csv')
data.head(3)

   Rank        Country  Technology  Talent  Tolerance  Global_Creativity_Index
0     1      Australia         7.0     1.0        4.0                    0.970
1     2  United States         4.0     3.0       11.0                    0.950
2     3    New Zealand         7.0     8.0        3.0                    0.949

In [69]:
education.to_sql(name='Education', con=motor, if_exists='append', index=False)

In [70]:
pd.read_sql('select * from Education', motor).head(3)

  Rank        Country Technology Talent Tolerance Global_Creativity_Index
0    1      Australia          7      1         4                    0.97
1    2  United States          4      3        11                    0.95
2    3    New Zealand          7      8         3                   0.949

In [71]:
data=pd.read_csv('df_80.csv')
data.head(3)

          Country    Date    AnnualGDP AnnualGDP.1 GDP _Growth_percentage
0   United States  1980.0  $2,857,300M       -0.3%                    NaN
1       Euro zone  1980.0  $2,962,181M         NaN                    NaN
2  United Kingdom  1980.0    €406,184M   $603,983M                  -2.0%

In [72]:
df_80.to_sql(name='GDP_80', con=motor, if_exists='append', index=False)

In [73]:
pd.read_sql('select * from GDP_80', motor).head(3)

          Country  Date  AnnualGDP GDP _Growth_percentage
0   United States  1980      -0.3%                   None
1       Euro zone  1980       None                   None
2  United Kingdom  1980  $603,983M                  -2.0%

In [74]:
data=pd.read_csv('df_99.csv')
data.head(3)

          Country    Date    AnnualGDP  AnnualGDP.1 GDP _Growth_percentage
0   United States  1999.0  €9,036,592M  $9,631,200M                   4.8%
1       Euro zone  1999.0  €6,456,826M  $7,113,797M                   2.9%
2  United Kingdom  1999.0  €1,578,395M  $1,682,590M                   3.3%

In [75]:
df_99.to_sql(name='GDP_99', con=motor, if_exists='append', index=False)

In [76]:
pd.read_sql('select * from GDP_99', motor).head(3)

          Country  Date    AnnualGDP GDP _Growth_percentage
0   United States  1999  $9,631,200M                   4.8%
1       Euro zone  1999  $7,113,797M                   2.9%
2  United Kingdom  1999  $1,682,590M                   3.3%

In [77]:
data=pd.read_csv('df_10.csv')
data.head(3)

          Country    Date     AnnualGDP   AnnualGDP.1 GDP _Growth_percentage
0   United States  2010.0  €11,351,739M  $15,049,000M                   2.7%
1       Euro zone  2010.0   €9,472,472M  $12,629,070M                   2.2%
2  United Kingdom  2010.0   €1,872,176M   $2,484,020M                   2.1%

In [78]:
df_10.to_sql(name='GDP_10', con=motor, if_exists='append', index=False)

In [80]:
pd.read_sql('select * from GDP_10', motor).head(3)

          Country  Date     AnnualGDP GDP _Growth_percentage
0   United States  2010  $15,049,000M                   2.7%
1       Euro zone  2010  $12,629,070M                   2.2%
2  United Kingdom  2010   $2,484,020M                   2.1%

In [81]:
data=pd.read_csv('df_20.csv')
data.head(3)

          Country    Date     AnnualGDP   AnnualGDP.1 GDP _Growth_percentage
0   United States  2020.0  €18,292,506M  $20,893,700M                  -3.4%
1       Euro zone  2020.0  €11,400,271M  $13,021,206M                  -6.4%
2  United Kingdom  2020.0   €2,423,371M   $2,709,680M                  -9.7%

In [82]:
df_20.to_sql(name='GDP_20', con=motor, if_exists='append', index=False)

In [84]:
pd.read_sql('select * from GDP_20', motor).head(3)

          Country  Date     AnnualGDP GDP _Growth_percentage
0   United States  2020  $20,893,700M                  -3.4%
1       Euro zone  2020  $13,021,206M                  -6.4%
2  United Kingdom  2020   $2,709,680M                  -9.7%

In [85]:
query=pd.read_sql('''
                    select Artists.Classification, Artists.year, Artists.artist, Education.Country, Education.Rank, Education.Global_Creativity_Index, GDP.AnnualGDP
                    from Artists
                    left join Education
                    on Artists.country=Education.Country
                    left join GDP
                    on GDP.Country=Education.Country
                    group by Education.Country;
                    ''',
                motor)

In [86]:
query

,Classification,year,artist,Country,Rank,Global_Creativity_Index,AnnualGDP
0,Architecture,1987,Christian de Portzamparc,France,16,0.822,"$701,305M"
1,Architecture,1987,Rem Koolhaas,Netherlands,10,0.889,"$193,758M"
2,Architecture,1979,Roger C. Ferri,United States,2,0.95,-0.3%
3,Architecture,1974,Aldo Rossi,Italy,21,0.715,"$482,019M"
4,Architecture,1979,Peter Cook,United Kingdom,12,0.881,"$603,983M"
...,...,...,...,...,...,...,...
81,Video,2006,Garin Nugroho,Indonesia,115,0.202,9.9%
82,Video,2007,Nan Achnas,Singapore,9,0.896,10.1%
83,Video,2006,Jeffrey Jeturian,Philippines,52,0.487,5.1%
84,Film,2006,João Luis Sol de Carvalho,Mozambique,90,0.346,4.2%
85,Design,1972,Velazquez Ribero,Dominican Republic,78,0.38,8.0%